benchmarks/results/auth-serialization/test-ping/with-logging/wrk2-logs/run_1_2605_1541.txt
Running 30s test @ http://127.0.0.1:8000/ping
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.971ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.330ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.17ms    3.41ms  81.86ms   99.49%
    Req/Sec   527.36     81.91     1.10k    79.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.04ms
 75.000%    3.46ms
 90.000%    3.89ms
 99.000%    5.03ms
 99.900%   66.69ms
 99.990%   81.47ms
 99.999%   81.92ms
100.000%   81.92ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.697     0.000000            1         1.00
       1.799     0.100000         2001         1.11
       2.399     0.200000         4004         1.25
       2.675     0.300000         6001         1.43
       2.871     0.400000         8012         1.67
       3.037     0.500000        10002         2.00
       3.115     0.550000        10986         2.22
       3.197     0.600000        12004         2.50
       3.281     0.650000        12996         2.86
       3.367     0.700000        13985         3.33
       3.465     0.750000        14985         4.00
       3.519     0.775000        15484         4.44
       3.575     0.800000        15984         5.00
       3.637     0.825000        16480         5.71
       3.709     0.850000        16990         6.67
       3.779     0.875000        17484         8.00
       3.829     0.887500        17728         8.89
       3.891     0.900000        17979        10.00
       3.955     0.912500        18232        11.43
       4.047     0.925000        18479        13.33
       4.147     0.937500        18730        16.00
       4.207     0.943750        18852        17.78
       4.271     0.950000        18976        20.00
       4.343     0.956250        19106        22.86
       4.427     0.962500        19229        26.67
       4.515     0.968750        19350        32.00
       4.571     0.971875        19413        35.56
       4.627     0.975000        19475        40.00
       4.691     0.978125        19541        45.71
       4.755     0.981250        19602        53.33
       4.839     0.984375        19667        64.00
       4.883     0.985938        19697        71.11
       4.931     0.987500        19725        80.00
       4.999     0.989062        19757        91.43
       5.059     0.990625        19788       106.67
       5.171     0.992188        19819       128.00
       5.251     0.992969        19834       142.22
       5.395     0.993750        19851       160.00
       5.671     0.994531        19865       182.86
      12.055     0.995313        19881       213.33
      24.031     0.996094        19896       256.00
      29.727     0.996484        19904       284.44
      34.719     0.996875        19912       320.00
      39.263     0.997266        19920       365.71
      47.839     0.997656        19928       426.67
      52.863     0.998047        19935       512.00
      56.671     0.998242        19939       568.89
      58.655     0.998437        19943       640.00
      62.239     0.998633        19947       731.43
      63.647     0.998828        19951       853.33
      66.943     0.999023        19955      1024.00
      68.159     0.999121        19957      1137.78
      70.655     0.999219        19959      1280.00
      71.679     0.999316        19961      1462.86
      72.127     0.999414        19963      1706.67
      75.647     0.999512        19965      2048.00
      75.967     0.999561        19966      2275.56
      76.095     0.999609        19967      2560.00
      76.479     0.999658        19968      2925.71
      76.799     0.999707        19969      3413.33
      77.119     0.999756        19970      4096.00
      77.119     0.999780        19970      4551.11
      81.087     0.999805        19971      5120.00
      81.087     0.999829        19971      5851.43
      81.471     0.999854        19972      6826.67
      81.471     0.999878        19972      8192.00
      81.471     0.999890        19972      9102.22
      81.791     0.999902        19973     10240.00
      81.791     0.999915        19973     11702.86
      81.791     0.999927        19973     13653.33
      81.791     0.999939        19973     16384.00
      81.791     0.999945        19973     18204.44
      81.919     0.999951        19974     20480.00
      81.919     1.000000        19974          inf
#[Mean    =        3.167, StdDeviation   =        3.406]
#[Max     =       81.856, Total count    =        19974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29994 requests in 30.00s, 5.23MB read
Requests/sec:    999.71
Transfer/sec:    178.67KB