benchmarks/results/auth-serialization/test-ping/with-logging/wrk2-logs/run_2_2605_1542.txt
Running 30s test @ http://127.0.0.1:8000/ping
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.936ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.997ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.83ms    3.01ms  82.37ms   99.62%
    Req/Sec   527.16     95.04     1.00k    76.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.71ms
 75.000%    3.11ms
 90.000%    3.56ms
 99.000%    4.41ms
 99.900%   61.82ms
 99.990%   81.86ms
 99.999%   82.43ms
100.000%   82.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.696     0.000000            1         1.00
       1.727     0.100000         2002         1.11
       2.111     0.200000         4009         1.25
       2.375     0.300000         6003         1.43
       2.559     0.400000         8008         1.67
       2.711     0.500000         9989         2.00
       2.787     0.550000        10987         2.22
       2.863     0.600000        12008         2.50
       2.939     0.650000        12999         2.86
       3.021     0.700000        14005         3.33
       3.111     0.750000        14981         4.00
       3.163     0.775000        15482         4.44
       3.225     0.800000        15996         5.00
       3.293     0.825000        16483         5.71
       3.369     0.850000        16982         6.67
       3.461     0.875000        17485         8.00
       3.507     0.887500        17733         8.89
       3.557     0.900000        17978        10.00
       3.615     0.912500        18235        11.43
       3.675     0.925000        18485        13.33
       3.749     0.937500        18728        16.00
       3.787     0.943750        18853        17.78
       3.833     0.950000        18979        20.00
       3.887     0.956250        19103        22.86
       3.947     0.962500        19227        26.67
       4.001     0.968750        19352        32.00
       4.045     0.971875        19413        35.56
       4.091     0.975000        19478        40.00
       4.139     0.978125        19538        45.71
       4.195     0.981250        19601        53.33
       4.247     0.984375        19665        64.00
       4.283     0.985938        19696        71.11
       4.339     0.987500        19726        80.00
       4.379     0.989062        19757        91.43
       4.427     0.990625        19787       106.67
       4.479     0.992188        19818       128.00
       4.515     0.992969        19834       142.22
       4.559     0.993750        19852       160.00
       4.651     0.994531        19865       182.86
       4.735     0.995313        19881       213.33
       5.111     0.996094        19896       256.00
       8.727     0.996484        19904       284.44
      17.967     0.996875        19912       320.00
      27.183     0.997266        19920       365.71
      37.471     0.997656        19928       426.67
      42.943     0.998047        19935       512.00
      47.615     0.998242        19939       568.89
      53.023     0.998437        19943       640.00
      55.103     0.998633        19947       731.43
      59.967     0.998828        19951       853.33
      64.543     0.999023        19955      1024.00
      65.023     0.999121        19957      1137.78
      67.647     0.999219        19959      1280.00
      69.631     0.999316        19961      1462.86
      70.975     0.999414        19963      1706.67
      73.087     0.999512        19965      2048.00
      75.583     0.999561        19966      2275.56
      76.159     0.999609        19968      2560.00
      76.159     0.999658        19968      2925.71
      77.247     0.999707        19969      3413.33
      78.015     0.999756        19970      4096.00
      78.015     0.999780        19970      4551.11
      81.023     0.999805        19971      5120.00
      81.023     0.999829        19971      5851.43
      81.855     0.999854        19972      6826.67
      81.855     0.999878        19972      8192.00
      81.855     0.999890        19972      9102.22
      82.431     0.999902        19974     10240.00
      82.431     1.000000        19974          inf
#[Mean    =        2.827, StdDeviation   =        3.010]
#[Max     =       82.368, Total count    =        19974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29994 requests in 30.00s, 5.24MB read
Requests/sec:    999.69
Transfer/sec:    178.67KB