benchmarks/results/auth-serialization/test-ping/with-logging/wrk2-logs/run_3_2605_1543.txt
Running 30s test @ http://127.0.0.1:8000/ping
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.720ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.821ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.96ms    2.99ms  83.39ms   99.64%
    Req/Sec   526.93     91.45     1.00k    78.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.76ms
 75.000%    3.27ms
 90.000%    3.76ms
 99.000%    4.69ms
 99.900%   63.49ms
 99.990%   80.83ms
 99.999%   83.46ms
100.000%   83.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.725     0.000000            3         1.00
       1.983     0.100000         2003         1.11
       2.247     0.200000         4009         1.25
       2.423     0.300000         6010         1.43
       2.589     0.400000         7999         1.67
       2.761     0.500000         9988         2.00
       2.851     0.550000        10988         2.22
       2.945     0.600000        11997         2.50
       3.043     0.650000        12989         2.86
       3.155     0.700000        13984         3.33
       3.273     0.750000        14989         4.00
       3.337     0.775000        15489         4.44
       3.403     0.800000        15989         5.00
       3.483     0.825000        16483         5.71
       3.565     0.850000        16989         6.67
       3.651     0.875000        17484         8.00
       3.699     0.887500        17727         8.89
       3.755     0.900000        17982        10.00
       3.809     0.912500        18237        11.43
       3.869     0.925000        18480        13.33
       3.943     0.937500        18730        16.00
       3.989     0.943750        18858        17.78
       4.025     0.950000        18977        20.00
       4.069     0.956250        19106        22.86
       4.123     0.962500        19225        26.67
       4.199     0.968750        19352        32.00
       4.239     0.971875        19419        35.56
       4.295     0.975000        19477        40.00
       4.343     0.978125        19543        45.71
       4.403     0.981250        19603        53.33
       4.467     0.984375        19662        64.00
       4.511     0.985938        19694        71.11
       4.551     0.987500        19725        80.00
       4.635     0.989062        19757        91.43
       4.715     0.990625        19787       106.67
       4.791     0.992188        19818       128.00
       4.875     0.992969        19834       142.22
       4.955     0.993750        19850       160.00
       5.051     0.994531        19865       182.86
       5.171     0.995313        19881       213.33
       5.283     0.996094        19896       256.00
       6.971     0.996484        19904       284.44
      17.167     0.996875        19912       320.00
      26.975     0.997266        19920       365.71
      33.919     0.997656        19928       426.67
      43.743     0.998047        19935       512.00
      46.591     0.998242        19939       568.89
      50.239     0.998437        19943       640.00
      55.807     0.998633        19947       731.43
      60.319     0.998828        19951       853.33
      64.063     0.999023        19955      1024.00
      65.983     0.999121        19958      1137.78
      66.175     0.999219        19959      1280.00
      70.399     0.999316        19961      1462.86
      72.127     0.999414        19963      1706.67
      73.343     0.999512        19965      2048.00
      73.407     0.999561        19966      2275.56
      75.967     0.999609        19967      2560.00
      76.223     0.999658        19968      2925.71
      77.823     0.999707        19969      3413.33
      77.887     0.999756        19970      4096.00
      77.887     0.999780        19970      4551.11
      78.975     0.999805        19971      5120.00
      78.975     0.999829        19971      5851.43
      80.831     0.999854        19972      6826.67
      80.831     0.999878        19972      8192.00
      80.831     0.999890        19972      9102.22
      81.151     0.999902        19973     10240.00
      81.151     0.999915        19973     11702.86
      81.151     0.999927        19973     13653.33
      81.151     0.999939        19973     16384.00
      81.151     0.999945        19973     18204.44
      83.455     0.999951        19974     20480.00
      83.455     1.000000        19974          inf
#[Mean    =        2.957, StdDeviation   =        2.987]
#[Max     =       83.392, Total count    =        19974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29994 requests in 30.00s, 5.23MB read
Requests/sec:    999.70
Transfer/sec:    178.66KB